# <center><font face="arial" size="5" color=#0101DF>NUMERIQUE ET SCIENCES INFORMATIQUES Terminale NSI</font></center>

## <font color=#013ADF>Séquence N° 5 : Bases de données - Structured Query Language (SQL) 1ère partie</font>

<div class="alert alert-danger" role="alert">
    
Les objectifs de cette séquence sont :

- Identifier les concepts définissant le modèle relationnel ;
- Savoir distinguer la structure d'une base de données de son contenu ;
- Repérer des anomalies dans le schéma d'une base de données ;
- Identifier les services rendus par un système de gestion de bases de données relationnelles : persistance des données, gestion des accès concurrrents, efficacité de traitemenet des requêtes, sécurisation des accès ;
- Identifier les composants d'une requête ;
- Construire des requêtes d'interrogation à l'aide des clauses du langage SQL : SELECT, FROM, WHERE, JOIN ;
- Construire des requêtes d'insertion et de mise à jour à l'aide de : UPDATE, INSERT, DELETE.


</div>

<div class="alert alert-success">
<img src="Images/employes.png" alt="BDD" width=50% align=center>
    
Saisir avec l'application DB Browser for SQLite la base de données `Employes.db` comportant une seule table `employes`ci-dessus.
<div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler votre requête pour afficher l'intégralité de la table employes.
<div>

In [2]:
%load_ext sql

In [3]:
%reload_ext sql

In [5]:
%%sql sqlite:///employes.db
SELECT * FROM employes

Done.

[(1, 'Jean', 1, 2500.2, 29),
 (2, 'Michel', 2, 1200.0, 21),
 (3, 'Joséphine', 1, 2435.1, 35),
 (5, 'Hélène', 1, 2480.99, 28),
 (6, 'Céline', 2, 1200.0, 28),
 (7, 'Jacques', 2, 1250.3, 26),
 (8, 'Charles', 1, 800.0, 19)]

<div class="alert alert-success">
    
Nous allons utiliser des fonctions d'agrégation. Elles permettent de faire des calculs sur un ensemble de valeurs et retourner un résultat unique. Elles associent plusieurs enregistrements en entrée et renvoient une valeur unique en sortie sauf dans le cas où elles utilisent la clause GROUP BY. 
<div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler des requêtes qui donnent les résultats suivants :
    - Renvoie le salaire moyen des employés (AVG);
    - Renvoie le salaire moyen des employés de l'échelle de rémunération 1 ;
    - Renvoie le salaire le plus petit (MIN);
    - Renvoie le salaire le plus grand (MAX).
<div>

In [35]:
%%sql sqlite:///employes.db
SELECT AVG(salaire) FROM employes; -- SELECT ROUND(AVG(salaire),2) FROM employes;

Done.

[(1704.5271428571427,)]

In [9]:
%%sql sqlite:///employes.db
SELECT AVG(salaire) FROM employes WHERE echelle_remu=1;

Done.

[(1695.2271428571426,)]

In [11]:
%%sql sqlite:///employes.db
SELECT MIN(salaire) FROM employes;

Done.

[(800.0,)]

In [12]:
%%sql sqlite:///employes.db
SELECT MAX(salaire) FROM employes;

Done.

[(2500.2,)]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler des requêtes qui donnent les résultats suivants :
    - Renvoie le nombre de salariés ;
    - Renvoie le nombre de salariés dont l'échelle de rémunération est 2;
    - Modifie le salaire de Joséphine pour qu'il soit identique à celui de Jean ;
    - Renvoie le nombre de salaires différents de l'entreprise ;
    - Renvoie le montant des salaires mensuels à payer (SUM) ;
    - Renvoie la liste des employés classés selon l'ordre de salaires décroissants ;

- Charles qui estimait que son salaire était insuffisant a démissionné :
    - Mettre à jour la base de données ;
    
- Son remplaçant se nomme Jean. Il est âgé de 19 ans. Il aura un salaire de 800 euros dans l'échelle de rémunération 1.
    - Mettre à jour la base de données.

    
<div>

In [13]:
%%sql sqlite:///employes.db
SELECT COUNT(*) FROM employes;

Done.

[(7,)]

In [5]:
%%sql sqlite:///employes.db
SELECT COUNT(*) FROM employes WHERE echelle_remu=2;

Done.

[(3,)]

In [18]:
%%sql sqlite:///employes.db
UPDATE employes 
SET salaire=2500.2
WHERE nom = 'Joséphine'

1 rows affected.

[]

In [20]:
%%sql sqlite:///employes.db
SELECT COUNT(DISTINCT salaire) FROM employes;

Done.

[(5,)]

In [4]:
%%sql sqlite:///employes.db
SELECT SUM(salaire) AS 'Somme de salaires' FROM employes;

Done.

[(11931.689999999999,)]

In [22]:
%%sql sqlite:///employes.db
SELECT * FROM employes ORDER BY salaire DESC;

Done.

[(1, 'Jean', 1, 2500.2, 29),
 (3, 'Joséphine', 1, 2500.2, 35),
 (5, 'Hélène', 1, 2480.99, 28),
 (7, 'Jacques', 2, 1250.3, 26),
 (2, 'Michel', 2, 1200.0, 21),
 (6, 'Céline', 2, 1200.0, 28),
 (8, 'Charles', 1, 800.0, 19)]

In [ ]:
%%sql sqlite:///employes.db
SELECT * FROM employes ORDER BY salaire DESC;

In [24]:
%%sql sqlite:///employes.db
DELETE FROM employes WHERE nom='Charles'

1 rows affected.

[]

In [28]:
%%sql sqlite:///employes.db
INSERT INTO employes (nom, echelle_remu, salaire, age) VALUES ('Jean', 1, 800, 19)

1 rows affected.

[]

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

Le choix de l'attribut `nom` n'a pas été très judicieux. On souhaite ajouter un attribut `prenom`, puis de copier le nom dans ce nouvel attribut. On remplace à titre provisoire, le nom par un point d'interrogation.
    
- Modifier la table `employes`;

    
<div>

In [30]:
%%sql sqlite:///employes.db
ALTER TABLE employes ADD COLUMN prenom TEXT;

Done.

[]

In [33]:
%%sql sqlite:///employes.db
UPDATE employes SET prenom=nom;
UPDATE employes SET nom="?";

7 rows affected.
7 rows affected.

[]

In [34]:
%%sql sqlite:///employes.db
SELECT * FROM employes

Done.

[(1, '?', 1, 2500.2, 29, 'Jean'),
 (2, '?', 2, 1200.0, 21, 'Michel'),
 (3, '?', 1, 2500.2, 35, 'Joséphine'),
 (5, '?', 1, 2480.99, 28, 'Hélène'),
 (6, '?', 2, 1200.0, 28, 'Céline'),
 (7, '?', 2, 1250.3, 26, 'Jacques'),
 (9, '?', 1, 800.0, 19, 'Jean')]